fixtures/vcr_cassettes/ChartMogul_Transactions_Payment/API_Interactions/correctly_interracts_with_the_API.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.chartmogul.com/v1/data_sources
    body:
      encoding: UTF-8
      string: '{"name":"Invoice Payment Test Data Source"}'
    headers:
      User-Agent:
      - Faraday v0.9.2
      Content-Type:
      - application/json
      Authorization:
      - Basic hidden
  response:
    status:
      code: 201
      message:
    headers:
      server:
      - nginx/1.9.10
      date:
      - Thu, 23 Jun 2016 14:47:22 GMT
      content-type:
      - application/json; charset=utf-8
      transfer-encoding:
      - chunked
      connection:
      - close
      x-frame-options:
      - SAMEORIGIN
      x-xss-protection:
      - 1; mode=block
      x-content-type-options:
      - nosniff
      etag:
      - W/"ad541e45449462884dced1b527da7376"
      cache-control:
      - max-age=0, private, must-revalidate
      x-request-id:
      - d542ffb6-712b-4678-8363-d6d69f6a9111
      x-runtime:
      - '0.533348'
      strict-transport-security:
      - max-age=15768000
    body:
      encoding: UTF-8
      string: '{"uuid":"ds_e25656b4-035e-433c-80e7-46c783271e9f","name":"Invoice Payment
        Test Data Source","created_at":"2016-06-23T14:47:21.996Z","status":"never_imported"}'
    http_version:
  recorded_at: Thu, 23 Jun 2016 14:47:22 GMT
- request:
    method: post
    uri: https://api.chartmogul.com/v1/customers
    body:
      encoding: UTF-8
      string: '{"data_source_uuid":"ds_e25656b4-035e-433c-80e7-46c783271e9f","external_id":"test_cus_ext_id","name":"Test
        Customer"}'
    headers:
      User-Agent:
      - Faraday v0.9.2
      Content-Type:
      - application/json
      Authorization:
      - Basic hidden
  response:
    status:
      code: 201
      message:
    headers:
      server:
      - nginx/1.9.10
      date:
      - Thu, 23 Jun 2016 14:47:22 GMT
      content-type:
      - application/json; charset=utf-8
      transfer-encoding:
      - chunked
      connection:
      - close
      x-frame-options:
      - SAMEORIGIN
      x-xss-protection:
      - 1; mode=block
      x-content-type-options:
      - nosniff
      etag:
      - W/"aeef9d5a4cd0ede802c52624fed11704"
      cache-control:
      - max-age=0, private, must-revalidate
      x-request-id:
      - 204614cd-6de5-482d-9e85-78ad381a412f
      x-runtime:
      - '0.227565'
      strict-transport-security:
      - max-age=15768000
    body:
      encoding: UTF-8
      string: '{"uuid":"cus_fe40373d-fe78-4bd4-8c14-9d459abf7849","external_id":"test_cus_ext_id","name":"Test
        Customer","company":"","email":"","city":"","state":"","country":"","zip":"","data_source_uuid":"ds_e25656b4-035e-433c-80e7-46c783271e9f"}'
    http_version:
  recorded_at: Thu, 23 Jun 2016 14:47:22 GMT
- request:
    method: post
    uri: https://api.chartmogul.com/v1/import/customers/cus_fe40373d-fe78-4bd4-8c14-9d459abf7849/invoices
    body:
      encoding: UTF-8
      string: '{"invoices":[{"date":"2016-01-01 12:00:00 +0000","currency":"USD","line_items":[{"type":"one_time","amount_in_cents":1000}],"external_id":"test_tr_inv_ext_id"}],"customer_uuid":"cus_fe40373d-fe78-4bd4-8c14-9d459abf7849"}'
    headers:
      User-Agent:
      - Faraday v0.9.2
      Content-Type:
      - application/json
      Authorization:
      - Basic hidden
  response:
    status:
      code: 201
      message:
    headers:
      server:
      - nginx/1.9.10
      date:
      - Thu, 23 Jun 2016 14:47:23 GMT
      content-type:
      - application/json; charset=utf-8
      transfer-encoding:
      - chunked
      connection:
      - close
      x-frame-options:
      - SAMEORIGIN
      x-xss-protection:
      - 1; mode=block
      x-content-type-options:
      - nosniff
      etag:
      - W/"150cd5f67ca1628b517a908c79aea1f0"
      cache-control:
      - max-age=0, private, must-revalidate
      x-request-id:
      - a4ac21cc-0a36-4e85-a055-5a0d1f568caf
      x-runtime:
      - '0.063138'
      strict-transport-security:
      - max-age=15768000
    body:
      encoding: UTF-8
      string: '{"invoices":[{"uuid":"inv_8418d38b-e132-481f-ad4e-d914809f9e19","external_id":"test_tr_inv_ext_id","date":"2016-01-01T12:00:00.000Z","due_date":null,"currency":"USD","line_items":[{"uuid":"li_3be740bd-c725-444d-9745-6476fa3a6d02","external_id":null,"type":"one_time","description":"","amount_in_cents":1000,"quantity":1,"discount_code":"","discount_amount_in_cents":0,"tax_amount_in_cents":0}],"transactions":[]}]}'
    http_version:
  recorded_at: Thu, 23 Jun 2016 14:47:23 GMT
- request:
    method: post
    uri: https://api.chartmogul.com/v1/import/invoices/inv_8418d38b-e132-481f-ad4e-d914809f9e19/transactions
    body:
      encoding: UTF-8
      string: '{"type":"payment","date":"2016-01-01 12:00:00 +0000","result":"successful","external_id":"test_tr_ext_id","invoice_uuid":"inv_8418d38b-e132-481f-ad4e-d914809f9e19"}'
    headers:
      User-Agent:
      - Faraday v0.9.2
      Content-Type:
      - application/json
      Authorization:
      - Basic hidden
  response:
    status:
      code: 201
      message:
    headers:
      server:
      - nginx/1.9.10
      date:
      - Thu, 23 Jun 2016 14:47:23 GMT
      content-type:
      - application/json; charset=utf-8
      transfer-encoding:
      - chunked
      connection:
      - close
      x-frame-options:
      - SAMEORIGIN
      x-xss-protection:
      - 1; mode=block
      x-content-type-options:
      - nosniff
      etag:
      - W/"48311e31dff0fe8a0f49c3aa28e735e4"
      cache-control:
      - max-age=0, private, must-revalidate
      x-request-id:
      - 2119149d-ee00-47ac-9c61-20ccef186710
      x-runtime:
      - '0.062007'
      strict-transport-security:
      - max-age=15768000
    body:
      encoding: UTF-8
      string: '{"uuid":"tr_448b68d3-63cd-4646-933b-c18807c16bad","external_id":"test_tr_ext_id","type":"payment","date":"2016-01-01T12:00:00.000Z","result":"successful"}'
    http_version:
  recorded_at: Thu, 23 Jun 2016 14:47:23 GMT
- request:
    method: delete
    uri: https://api.chartmogul.com/v1/data_sources/ds_e25656b4-035e-433c-80e7-46c783271e9f
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - Faraday v0.9.2
      Authorization:
      - Basic hidden
  response:
    status:
      code: 204
      message:
    headers:
      server:
      - nginx/1.9.10
      date:
      - Thu, 23 Jun 2016 14:47:23 GMT
      connection:
      - close
      x-frame-options:
      - SAMEORIGIN
      x-xss-protection:
      - 1; mode=block
      x-content-type-options:
      - nosniff
      cache-control:
      - no-cache
      x-request-id:
      - 55112f9c-3f91-4ee0-85f4-0ba629912856
      x-runtime:
      - '0.009105'
      strict-transport-security:
      - max-age=15768000
    body:
      encoding: UTF-8
      string: ''
    http_version:
  recorded_at: Thu, 23 Jun 2016 14:47:23 GMT
recorded_with: VCR 3.0.3
