spec/fixtures/vcr_cassettes/ChartMogul_Transactions_Payment/API_Interactions/correctly_interracts_with_the_API.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.chartmogul.com/v1/data_sources
    body:
      encoding: UTF-8
      string: '{"name":"Invoice Payment Test Data Source 2b1e8a1a4dbcf11da414"}'
    headers:
      User-Agent:
      - chartmogul-ruby/4.5.0
      Content-Type:
      - application/json
      Authorization:
      - Basic hidden
  response:
    status:
      code: 201
      message: Created
    headers:
      date:
      - Fri, 14 Mar 2025 14:28:50 GMT
      content-type:
      - application/json
      content-length:
      - '191'
      connection:
      - keep-alive
      access-control-allow-credentials:
      - 'true'
    body:
      encoding: UTF-8
      string: '{"uuid":"ds_a600663e-00e0-11f0-aa37-6f2aa1355b7a","name":"Invoice Payment
        Test Data Source 2b1e8a1a4dbcf11da414","system":"Import API","created_at":"2025-03-14T14:28:50.595Z","status":"idle"}'
    http_version:
  recorded_at: Fri, 14 Mar 2025 14:28:50 GMT
- request:
    method: post
    uri: https://api.chartmogul.com/v1/customers
    body:
      encoding: UTF-8
      string: '{"external_id":"test_cus_ext_id","name":"Test Customer","data_source_uuid":"ds_a600663e-00e0-11f0-aa37-6f2aa1355b7a"}'
    headers:
      User-Agent:
      - chartmogul-ruby/4.5.0
      Content-Type:
      - application/json
      Authorization:
      - Basic hidden
  response:
    status:
      code: 201
      message: Created
    headers:
      date:
      - Fri, 14 Mar 2025 14:28:51 GMT
      content-type:
      - application/json
      content-length:
      - '799'
      connection:
      - keep-alive
      access-control-allow-credentials:
      - 'true'
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        eyJpZCI6MjA0ODE5ODE4LCJ1dWlkIjoiY3VzX2E2NDE5MDE0LTAwZTAtMTFmMC1hYTM4LWZiYmJlYTJiNmM3MiIsImV4dGVybmFsX2lkIjoidGVzdF9jdXNfZXh0X2lkIiwibmFtZSI6IlRlc3QgQ3VzdG9tZXIiLCJlbWFpbCI6IiIsInN0YXR1cyI6Ik5ldyBMZWFkIiwiY3VzdG9tZXItc2luY2UiOm51bGwsImF0dHJpYnV0ZXMiOnsiY3VzdG9tIjp7fSwic3RyaXBlIjp7fSwidGFncyI6W119LCJkYXRhX3NvdXJjZV91dWlkIjoiZHNfYTYwMDY2M2UtMDBlMC0xMWYwLWFhMzctNmYyYWExMzU1YjdhIiwiZGF0YV9zb3VyY2VfdXVpZHMiOlsiZHNfYTYwMDY2M2UtMDBlMC0xMWYwLWFhMzctNmYyYWExMzU1YjdhIl0sImV4dGVybmFsX2lkcyI6WyJ0ZXN0X2N1c19leHRfaWQiXSwiY29tcGFueSI6IiIsImNvdW50cnkiOm51bGwsInN0YXRlIjpudWxsLCJjaXR5IjpudWxsLCJ6aXAiOm51bGwsImxlYWRfY3JlYXRlZF9hdCI6bnVsbCwiZnJlZV90cmlhbF9zdGFydGVkX2F0IjpudWxsLCJhZGRyZXNzIjp7ImNvdW50cnkiOm51bGwsInN0YXRlIjpudWxsLCJjaXR5IjpudWxsLCJhZGRyZXNzX3ppcCI6bnVsbH0sIm1yciI6MCwiYXJyIjowLCJiaWxsaW5nLXN5c3RlbS11cmwiOm51bGwsImNoYXJ0bW9ndWwtdXJsIjoiaHR0cHM6Ly9hcHAuY2hhcnRtb2d1bC5jb20vIy9jdXN0b21lcnMvMjA0ODE5ODE4LVRlc3RfQ3VzdG9tZXIiLCJiaWxsaW5nLXN5c3RlbS10eXBlIjoiSW1wb3J0IEFQSSIsImN1cnJlbmN5IjoiSlBZIiwiY3VycmVuY3ktc2lnbiI6IsKlIiwib3duZXIiOm51bGwsIndlYnNpdGVfdXJsIjpudWxsfQ==
    http_version:
  recorded_at: Fri, 14 Mar 2025 14:28:51 GMT
- request:
    method: post
    uri: https://api.chartmogul.com/v1/import/customers/cus_a6419014-00e0-11f0-aa38-fbbbea2b6c72/invoices
    body:
      encoding: UTF-8
      string: '{"invoices":[{"date":"2016-01-01 12:00:00 UTC","currency":"USD","line_items":[{"type":"one_time","amount_in_cents":1000}],"external_id":"test_tr_inv_ext_id"}],"customer_uuid":"cus_a6419014-00e0-11f0-aa38-fbbbea2b6c72"}'
    headers:
      User-Agent:
      - chartmogul-ruby/4.5.0
      Content-Type:
      - application/json
      Authorization:
      - Basic hidden
  response:
    status:
      code: 201
      message: Created
    headers:
      date:
      - Fri, 14 Mar 2025 14:28:51 GMT
      content-type:
      - application/json; charset=utf-8
      content-length:
      - '556'
      connection:
      - keep-alive
      x-frame-options:
      - DENY
      x-xss-protection:
      - 1; mode=block
      x-content-type-options:
      - nosniff
      x-download-options:
      - noopen
      x-permitted-cross-domain-policies:
      - none
      referrer-policy:
      - strict-origin-when-cross-origin
      etag:
      - W/"df0bcf11a4845d409febea32ef3f9e41"
      cache-control:
      - max-age=0, private, must-revalidate
      x-request-id:
      - 6e321c108ca9dab79d86d6417f69f4c9
      x-runtime:
      - '0.153889'
      access-control-allow-credentials:
      - 'true'
    body:
      encoding: UTF-8
      string: '{"invoices":[{"uuid":"inv_d6921981-c0a7-46f6-a2d5-46367f2f97a1","date":"2016-01-01T12:00:00.000Z","due_date":null,"errors":{},"external_id":"test_tr_inv_ext_id","currency":"USD","line_items":[{"uuid":"li_dddabd51-df61-4604-8a80-3c482b81b8d8","external_id":null,"type":"one_time","description":null,"amount_in_cents":1000,"quantity":1,"discount_code":"","discount_amount_in_cents":0,"tax_amount_in_cents":0,"transaction_fees_in_cents":0,"account_code":"","transaction_fees_currency":null,"discount_description":null,"event_order":null}],"transactions":[]}]}'
    http_version:
  recorded_at: Fri, 14 Mar 2025 14:28:51 GMT
- request:
    method: post
    uri: https://api.chartmogul.com/v1/import/invoices/inv_d6921981-c0a7-46f6-a2d5-46367f2f97a1/transactions
    body:
      encoding: UTF-8
      string: '{"type":"payment","date":"2016-01-01 12:00:00 UTC","result":"successful","external_id":"test_tr_ext_id","amount_in_cents":500,"transaction_fees_in_cents":2,"invoice_uuid":"inv_d6921981-c0a7-46f6-a2d5-46367f2f97a1"}'
    headers:
      User-Agent:
      - chartmogul-ruby/4.5.0
      Content-Type:
      - application/json
      Authorization:
      - Basic hidden
  response:
    status:
      code: 201
      message: Created
    headers:
      date:
      - Fri, 14 Mar 2025 14:28:51 GMT
      content-type:
      - application/json; charset=utf-8
      content-length:
      - '206'
      connection:
      - keep-alive
      x-frame-options:
      - DENY
      x-xss-protection:
      - 1; mode=block
      x-content-type-options:
      - nosniff
      x-download-options:
      - noopen
      x-permitted-cross-domain-policies:
      - none
      referrer-policy:
      - strict-origin-when-cross-origin
      etag:
      - W/"eca2f52870b76862cc28593f74c3089d"
      cache-control:
      - max-age=0, private, must-revalidate
      x-request-id:
      - d5a38b215e8a02550b9add0676d73815
      x-runtime:
      - '0.138432'
      access-control-allow-credentials:
      - 'true'
    body:
      encoding: UTF-8
      string: '{"external_id":"test_tr_ext_id","result":"successful","amount_in_cents":500,"transaction_fees_in_cents":2,"uuid":"tr_c6f3f8df-4ca3-4034-bbc9-3004a338d37e","type":"payment","date":"2016-01-01T12:00:00.000Z"}'
    http_version:
  recorded_at: Fri, 14 Mar 2025 14:28:51 GMT
- request:
    method: delete
    uri: https://api.chartmogul.com/v1/data_sources/ds_a600663e-00e0-11f0-aa37-6f2aa1355b7a
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - chartmogul-ruby/4.5.0
      Authorization:
      - Basic hidden
  response:
    status:
      code: 204
      message: No Content
    headers:
      date:
      - Fri, 14 Mar 2025 14:28:52 GMT
      connection:
      - keep-alive
      access-control-allow-credentials:
      - 'true'
    body:
      encoding: UTF-8
      string: ''
    http_version:
  recorded_at: Fri, 14 Mar 2025 14:28:52 GMT
recorded_with: VCR 5.1.0
